/*************************************************************************
	> File Name: Euler28.cpp
	> Author: 
	> Mail: 
	> Created Time: 2018年07月22日 星期日 10时30分11秒
 ************************************************************************/

#include <stdio.h>

int main(){
    int sum = 1;//将初始的一维矩阵记录，由于其特殊性
    for(int i = 3; i <= 1001; i += 2){
        //观察发现对角线上的元素都位于奇数维的矩阵的四角，同时发现矩阵四角的元素从右上角顺时针依次的规律为n*n n*n-n+1 n*n-n+1-n+1 n*n-n+1-n+1-n+1相加为4*n*n - 6*n + 6
        sum +=  4 * i * i - 6 * i + 6;
    }
    printf("%d\n",sum);
    return 0;
}

